from aiogram.fsm.state import State, StatesGroup


# --- СТАНИ ДЛЯ РЕЄСТРАЦІЇ ТА ОСНОВНОГО МЕНЮ ---
class RegistrationStates(StatesGroup):
    """
    Стани, пов'язані з процесом первинної реєстрації користувача.
    """
    # 1. Стан очікування вводу ПІНа після команди /start
    awaiting_pin = State()

    # 2. Стан після успішної реєстрації (основний стан бездіяльності)
    main_menu = State()


# --- СТАНИ ДЛЯ ПРОХОДЖЕННЯ ТЕСТУВАННЯ ---
class TestingStates(StatesGroup):
    """
    Стани, пов'язані з активним проходженням тесту стажером.
    """
    # 3. Стан, коли користувач проходить тест (очікуємо на відповідь-callback)
    in_test = State()

    # 4. Стан очікування підтвердження результату або фінального огляду (якщо потрібно)
    review_results = State()